04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleFluid/motorBikeSteady/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  6;

decomposer      hierarchical;
distributor     ptscotch;
// distributor     zoltan;
// libs            ("libzoltanDecomp.so");

hierarchical
{
    n               (3 2 1);
    order           xyz;
}

zoltan
{
    lb_method       hypergraph;
    lb_approach     partition;
}


// ************************************************************************* //
